projects/rarefied-flows/impingment/sims/templates/compressible/rhoPimpleFoam/RAS/TJunctionAverage/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           $internalField;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    defaultFaces
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
